testhound/alo/llir/octave/m480/M480Factory.h
#ifndef _LLIR_M480_FACTORY_H
#define _LLIR_M480_FACTORY_H

#include <OctaveFactory.h>
#include "M480Instructions.h"

namespace Llir
{
  class M480Factory : public OctaveFactory
    {
    public:
      M480Factory();
      ~M480Factory();

      shared_ptr<OctaveInstruction> createAddwhInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>);

      shared_ptr<OctaveInstruction> createAddwlInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>);

      shared_ptr<OctaveInstruction> createAddwwInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>);

      shared_ptr<OctaveInstruction> createAddlInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register>, 
							  shared_ptr<const Register>, 
							  shared_ptr<const LlirOperand>);

      shared_ptr<OctaveInstruction> createAddwhiInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const UnsignedImmediate>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createAddwliInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const UnsignedImmediate>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createAddwwiInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const UnsignedImmediate>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createAddliInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const UnsignedImmediate>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>);

      shared_ptr<OctaveInstruction> createSubwhInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createSubwlInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createSubwwInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createSublInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register>, 
							  shared_ptr<const Register>, 
							  shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createSubwhiInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const UnsignedImmediate>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createSubwliInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const UnsignedImmediate>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createSubwwiInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const UnsignedImmediate>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>);
      shared_ptr<OctaveInstruction> createSubliInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const UnsignedImmediate>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>);

      shared_ptr<OctaveInstruction> createFfsInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> findFlag);
      shared_ptr<OctaveInstruction> createFlsInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> findFlag);
      shared_ptr<OctaveInstruction> createParInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag);

      shared_ptr<OctaveInstruction> createAddInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createAdd4xInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const Register> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag,
							   shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createAddcInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag,
							  shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createAddiInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const UnsignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag,
							  shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createAddciInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag,
							   shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createSubInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createSubbInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag,
							  shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createSubiInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const UnsignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag,
							  shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createSubbiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag,
							   shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createAndInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createAndiInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const SignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createOrInstruction(unsigned int lineNum,
							unsigned int srcLineNum,
							const char* srcFileName,
							shared_ptr<const Register> src1,
							shared_ptr<const Register> src2, 
							shared_ptr<const Register> dst, 
							shared_ptr<const LlirOperand> abcFlag,
							shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createOriInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const SignedImmediate> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createXorInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createXoriInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const SignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createMaxInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createMinInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> modFlag);
      shared_ptr<OctaveInstruction> createRandInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createRotlInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createRotrInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createClrbInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createSetbInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createShftInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createShftaInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const Register> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createShlInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createShrInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createShraInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createRandiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createRotliInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createRotriInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createSetbiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createClrbiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createShliInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const UnsignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createShriInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const UnsignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createShraiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createMaxiInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const SignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createMiniInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const SignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag);
      shared_ptr<OctaveInstruction> createMulInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> sxFlag);
      shared_ptr<OctaveInstruction> createMulhInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> sxFlag);
      shared_ptr<OctaveInstruction> createMuliInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const SignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> sxFlag);
      shared_ptr<OctaveInstruction> createMulhiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const SignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> sxFlag);
      shared_ptr<OctaveInstruction> createDivInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const Register> src2, 
							 shared_ptr<const Register> dst, 
							 shared_ptr<const LlirOperand> sxFlag);
      shared_ptr<OctaveInstruction> createDiviInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const SignedImmediate> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> sxFlag);
      shared_ptr<OctaveInstruction> createAddneInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const Register> src2, 
							   shared_ptr<const Register> dst);
      shared_ptr<OctaveInstruction> createAddneiInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> src1,
							    shared_ptr<const UnsignedImmediate> src2, 
							    shared_ptr<const Register> dst);
      shared_ptr<OctaveInstruction> createByteswInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> src1, 
							    shared_ptr<const Register> dst, 
							    shared_ptr<const UnsignedImmediate> b0, 
							    shared_ptr<const UnsignedImmediate> b1, 
							    shared_ptr<const UnsignedImmediate> b2, 
							    shared_ptr<const UnsignedImmediate> b3,
							    shared_ptr<const LlirOperand> abcFlag);

