testhound/alo/llir/octave/m480/M480Factory.h
      shared_ptr<OctaveInstruction> createBcdrInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1, 
							  shared_ptr<EssFlag>, 
							  shared_ptr<const LlirOperand> dst, 
							  shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createBcrInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1, 
							 shared_ptr<EssFlag>, 
							 shared_ptr<const LlirOperand> dst, 
							 shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createBcdiInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const LlirOperand> src1, 
							  shared_ptr<EssFlag>, 
							  shared_ptr<const LlirOperand> dst, 
							  shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createBciInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const LlirOperand> src1, 
							 shared_ptr<EssFlag>, 
							 shared_ptr<const LlirOperand> dst, 
							 shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createBnzrInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1, 
							  shared_ptr<const Register> src2, 
							  shared_ptr<const LlirOperand> cmpReg);
      shared_ptr<OctaveInstruction> createBzrInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1, 
							 shared_ptr<const Register> src2,
							 shared_ptr<const LlirOperand> cmpReg);
      shared_ptr<OctaveInstruction> createBnziInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1, 
							  shared_ptr<const LlirOperand> src2, 
							  shared_ptr<const LlirOperand> cmpReg);
      shared_ptr<OctaveInstruction> createBziInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1, 
							 shared_ptr<const LlirOperand> src2,
							 shared_ptr<const LlirOperand> cmpReg);
      shared_ptr<OctaveInstruction> createTsetbInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1, 
							   shared_ptr<const UnsignedImmediate> bitpos, 
							   shared_ptr<const LlirOperand> disp);
      shared_ptr<OctaveInstruction> createTclrbInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1, 
							   shared_ptr<const UnsignedImmediate> bitpos, 
							   shared_ptr<const LlirOperand> disp);
      shared_ptr<OctaveInstruction> createRnmiInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const LlirOperand> diFlag);
      shared_ptr<OctaveInstruction> createRintInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const LlirOperand> diFlag);
      shared_ptr<OctaveInstruction> createBrsInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const LlirOperand> dst);
      shared_ptr<OctaveInstruction> createBrslInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const LlirOperand> brslFlags);
      shared_ptr<OctaveInstruction> createBrspreInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName);
      shared_ptr<OctaveInstruction> createCmpInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1, 
							 shared_ptr<const Register> src2, 
							 shared_ptr<const LlirOperand> abcFlag,
							 shared_ptr<const LlirOperand> branchTarget);

      shared_ptr<OctaveInstruction> createCmpiInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1, 
							  shared_ptr<const SignedImmediate> src2, 
							  shared_ptr<const LlirOperand> abcFlag,
							  shared_ptr<const LlirOperand> branchTarget);

      shared_ptr<OctaveInstruction> createJcmpInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1, 
							  shared_ptr<const Register> src2, 
							  shared_ptr<const LlirOperand> abcFlag,
							  shared_ptr<const LlirOperand> branchTarget,
							  OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJcmpiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1, 
							   shared_ptr<const SignedImmediate> src2, 
							   shared_ptr<const LlirOperand> abcFlag,
							   shared_ptr<const LlirOperand> branchTarget,
							   OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createCmprInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> abcFlag,
							  shared_ptr<const LlirOperand> signFlag);
      shared_ptr<OctaveInstruction> createCmpriInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const SignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<const LlirOperand> abcFlag,
							   shared_ptr<const LlirOperand> signFlag);
      shared_ptr<OctaveInstruction> createBiInstruction(unsigned int lineNum,
							unsigned int srcLineNum,
							const char* srcFileName,
							shared_ptr<const LlirOperand> src1,
							shared_ptr<const LlirOperand> dst, 
							shared_ptr<const LlirOperand> cdFlag);
      shared_ptr<OctaveInstruction> createBrInstruction(unsigned int lineNum,
							unsigned int srcLineNum,
							const char* srcFileName,
							shared_ptr<const Register> src1,
							shared_ptr<const LlirOperand> dst);
      shared_ptr<OctaveInstruction> createJtablebrInstruction(unsigned int lineNum,
							      unsigned int srcLineNum,
							      const char* srcFileName,
							      shared_ptr<const Register> src1,
							      shared_ptr<const LlirOperand> dst);
      shared_ptr<OctaveInstruction> createJtableRelativebrInstruction(unsigned int lineNum,
								      unsigned int srcLineNum,
								      const char* srcFileName,
								      shared_ptr<const Register> src1,
								      shared_ptr<const LlirOperand> dst);
      shared_ptr<OctaveInstruction> createDepbInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src, 
							  shared_ptr<const UnsignedImmediate> srcBitNum,
							  shared_ptr<const Register> dst,
							  shared_ptr<const UnsignedImmediate> dstBitNum, 
							  shared_ptr<const UnsignedImmediate> numBits, 
							  shared_ptr<const LlirOperand> depbFlag);
      shared_ptr<OctaveInstruction> createDepbiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const UnsignedImmediate> src, 
							   shared_ptr<const Register> dst,
							   shared_ptr<const UnsignedImmediate> dstBitNum, 
							   shared_ptr<const UnsignedImmediate> numBits, 
							   shared_ptr<const LlirOperand> depbFlag);
      shared_ptr<OctaveInstruction> createExtbInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src, 
							  shared_ptr<const UnsignedImmediate> srcBitNum,
							  shared_ptr<const Register> dst,
							  shared_ptr<const UnsignedImmediate> dstBitNum, 
							  shared_ptr<const UnsignedImmediate> numBits, 
							  shared_ptr<const LlirOperand> signFlag);
      shared_ptr<OctaveInstruction> createCmovInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const Register> src2, 
							  shared_ptr<const Register> dst, 
							  shared_ptr<EssFlag> essFlag);
      shared_ptr<OctaveInstruction> createCmoviInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> src2, 
							   shared_ptr<const Register> dst, 
							   shared_ptr<EssFlag> essFlag);
      shared_ptr<OctaveInstruction> createDmapInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1,
							  shared_ptr<const UnsignedImmediate> flags);
      shared_ptr<OctaveInstruction> createDmasrInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> flags);
      shared_ptr<OctaveInstruction> createDmau0Instruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> flags);
      shared_ptr<OctaveInstruction> createDmau1Instruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1,
							   shared_ptr<const UnsignedImmediate> flags);
      shared_ptr<OctaveInstruction> createLihInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> dst,
							 shared_ptr<const LlirOperand> src);
      shared_ptr<OctaveInstruction> createLilInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> dst,
							 shared_ptr<const LlirOperand> src);
      shared_ptr<OctaveInstruction> createLwihInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> dst,
							  shared_ptr<const LlirOperand> src);
      shared_ptr<OctaveInstruction> createLwilInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> dst,
							  shared_ptr<const LlirOperand> src);
      shared_ptr<OctaveInstruction> createLaihInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> dst,
							  shared_ptr<const LlirOperand> src);
      shared_ptr<OctaveInstruction> createLailInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> dst,
							  shared_ptr<const LlirOperand> src);
      shared_ptr<OctaveInstruction> createNopInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName);

      shared_ptr<OctaveInstruction> createHec5Instruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src,
							  shared_ptr<const Register> dst,
							  shared_ptr<const UnsignedImmediate> bytes,
							  shared_ptr<const LlirOperand> cumeFlag,
							  shared_ptr<const LlirOperand> branchTarget);

      shared_ptr<OctaveInstruction> createJHec5Instruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src,
							   shared_ptr<const Register> dst,
							   shared_ptr<const UnsignedImmediate> bytes,
							   shared_ptr<const LlirOperand> cumeFlag,
							   shared_ptr<const LlirOperand> branchTarget,
							   OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createMvInstruction(unsigned int lineNum,
							unsigned int srcLineNum,
							const char* srcFileName,
							shared_ptr<const Register> src,
							shared_ptr<const Register> dst);
      shared_ptr<OctaveInstruction> createMvhrInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src,
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> mvhFlag);
      shared_ptr<OctaveInstruction> createMvrhInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src,
							  shared_ptr<const Register> dst, 
							  shared_ptr<const LlirOperand> mvhFlag);
      shared_ptr<OctaveInstruction> createUnlinkInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs);
      shared_ptr<OctaveInstruction> createLinkInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> regs,
							  shared_ptr<OctaveMemory> mem, 
							  shared_ptr<const LinkFlag> linkFlag);
      shared_ptr<OctaveInstruction> createLinksInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem, 
							   shared_ptr<const LinkFlag> linkFlag);
      shared_ptr<OctaveInstruction> createLinkspInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs,
							    shared_ptr<OctaveMemory> mem, 
							    shared_ptr<const LinkFlag> linkFlag); 
      shared_ptr<OctaveInstruction> createLinksplInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const Register> regs,
							     shared_ptr<OctaveMemory> mem, 
							     shared_ptr<const LinkFlag> linkFlag); 
      shared_ptr<OctaveInstruction> createLinksrInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs,
							    shared_ptr<OctaveMemory> mem, 
							    shared_ptr<const LinkFlag> linkFlag); 
      shared_ptr<OctaveInstruction> createLinksdInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs,
							    shared_ptr<OctaveMemory> mem, 
							    shared_ptr<const LinkFlag> linkFlag); 
      shared_ptr<OctaveInstruction> createLinkccInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs,
							    shared_ptr<OctaveMemory> mem, 
							    shared_ptr<const LinkFlag> linkFlag); 
      shared_ptr<OctaveInstruction> createLinkcclInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const Register> regs,
							     shared_ptr<OctaveMemory> mem, 
							     shared_ptr<const LinkFlag> linkFlag); 
      shared_ptr<OctaveInstruction> createLinksioInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const Register> regs,
							     shared_ptr<OctaveMemory> mem, 
							     shared_ptr<const LinkFlag> linkFlag);
      shared_ptr<OctaveInstruction> createLmmInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> regs,
							 shared_ptr<OctaveMemory> mem, 
							 shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLmmspInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem, 
							   shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLmmsplInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs,
							    shared_ptr<OctaveMemory> mem, 
							    shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLmmsrInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem, 
							   shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLmmsdInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem, 
							   shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLmmccInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem, 
							   shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLmmcclInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs,
							    shared_ptr<OctaveMemory> mem, 
							    shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLmmsiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem, 
							   shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLmmsInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> regs,
							  shared_ptr<OctaveMemory> mem, 
							  shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createLspInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> regs,
							 shared_ptr<OctaveMemory> mem, 
							 shared_ptr<const LlirOperand> linkFlag);
      shared_ptr<OctaveInstruction> createSmmInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> regs,
							 shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSmmspInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSmmsplInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs,
							    shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSmmsrInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSmmsdInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSmmccInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSmmcclInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> regs,
							    shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSmmsiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> regs,
							   shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSmmsInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> regs,
							  shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createSspInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> regs,
							 shared_ptr<OctaveMemory> mem);
      shared_ptr<OctaveInstruction> createPutInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> rsa,
							 shared_ptr<const Register> rsb,
							 shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createGetInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> rsa,
							 shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createPolInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> rsa,
							 shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createPutcInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const UnsignedImmediate> parOffset,
							  shared_ptr<const UnsignedImmediate> posOffset,
							  shared_ptr<const LlirOperand> pipeDepth,
							  shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createPutcInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> rsa,
							  shared_ptr<const Register> rsb, 
							  shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createPutmInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> rsa,
							  shared_ptr<const Register> rsb, 
							  shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createPutpInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> rsa,
							  shared_ptr<const Register> rsb, 
							  shared_ptr<const LlirOperand> flags);

      shared_ptr<OctaveInstruction> createPutdInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> rsa,
							  shared_ptr<const Register> rsb, 
							  shared_ptr<const LlirOperand> flags);

