testhound/alo/llir/octave/m480/M480Factory.h
      shared_ptr<OctaveInstruction> createGetcInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const UnsignedImmediate> parOffset,
							  shared_ptr<const UnsignedImmediate> posOffset,
							  shared_ptr<const LlirOperand> flags);
      shared_ptr<OctaveInstruction> createPolcInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const UnsignedImmediate> parOffset,
							  shared_ptr<const UnsignedImmediate> posOffset,
							  shared_ptr<const LlirOperand> flags);

      shared_ptr<OctaveInstruction> createJaddwhInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>,
							    OctaveInstruction::BranchProbability);
    
      shared_ptr<OctaveInstruction> createJaddwlInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>,
							    OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJaddwwInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>,
							    OctaveInstruction::BranchProbability);
    
      shared_ptr<OctaveInstruction> createJaddlInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>,
							   OctaveInstruction::BranchProbability);
      
      shared_ptr<OctaveInstruction> createJaddwhiInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const UnsignedImmediate>, 
							     shared_ptr<const Register>, 
							     shared_ptr<const LlirOperand>,
							     OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJaddwliInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const UnsignedImmediate>, 
							     shared_ptr<const Register>, 
							     shared_ptr<const LlirOperand>,
							     OctaveInstruction::BranchProbability);
      
      shared_ptr<OctaveInstruction> createJaddwwiInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const UnsignedImmediate>, 
							     shared_ptr<const Register>, 
							     shared_ptr<const LlirOperand>,
							     OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJaddliInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const UnsignedImmediate>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>,
							    OctaveInstruction::BranchProbability);


      shared_ptr<OctaveInstruction> createJsubwhInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>,
							    OctaveInstruction::BranchProbability);


      shared_ptr<OctaveInstruction> createJsubwlInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>,
							    OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJsubwwInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>,
							    OctaveInstruction::BranchProbability);
    
      shared_ptr<OctaveInstruction> createJsublInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register>, 
							   shared_ptr<const Register>, 
							   shared_ptr<const LlirOperand>,
							   OctaveInstruction::BranchProbability);
    
      shared_ptr<OctaveInstruction> createJsubwhiInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const UnsignedImmediate>, 
							     shared_ptr<const Register>, 
							     shared_ptr<const LlirOperand>,
							     OctaveInstruction::BranchProbability);
      
 
      shared_ptr<OctaveInstruction> createJsubwliInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const UnsignedImmediate>, 
							     shared_ptr<const Register>, 
							     shared_ptr<const LlirOperand>,
							     OctaveInstruction::BranchProbability);
      
  
      shared_ptr<OctaveInstruction> createJsubwwiInstruction(unsigned int lineNum,
							     unsigned int srcLineNum,
							     const char* srcFileName,
							     shared_ptr<const UnsignedImmediate>, 
							     shared_ptr<const Register>, 
							     shared_ptr<const LlirOperand>,
							     OctaveInstruction::BranchProbability);
      
      shared_ptr<OctaveInstruction> createJsubliInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const UnsignedImmediate>, 
							    shared_ptr<const Register>, 
							    shared_ptr<const LlirOperand>,
							    OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJbcdrInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1, 
							   shared_ptr<EssFlag>, 
							   shared_ptr<const LlirOperand> dst, 
							   shared_ptr<const LlirOperand> flags,
							   shared_ptr<const LlirOperand> targetList,
							   OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJbcdiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const LlirOperand> src1, 
							   shared_ptr<EssFlag>, 
							   shared_ptr<const LlirOperand> dst, 
							   shared_ptr<const LlirOperand> flags,
							   OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJbcrInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1, 
							  shared_ptr<EssFlag>, 
							  shared_ptr<const LlirOperand> dst, 
							  shared_ptr<const LlirOperand> flags,
							  shared_ptr<const LlirOperand> targetList,
							  OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJbciInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const LlirOperand> src1, 
							  shared_ptr<EssFlag>, 
							  shared_ptr<const LlirOperand> dst, 
							  shared_ptr<const LlirOperand> flags,
							  OctaveInstruction::BranchProbability);

