testhound/alo/llir/octave/m480/M480Factory.h
      shared_ptr<OctaveInstruction> createJbnzrInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1, 
							   shared_ptr<const Register> src2, 
							   shared_ptr<const LlirOperand> cmpReg,
							   shared_ptr<const LlirOperand> targetList,
							   OctaveInstruction::BranchProbability);
      
      shared_ptr<OctaveInstruction> createJbzrInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1, 
							  shared_ptr<const Register> src2, 
							  shared_ptr<const LlirOperand> cmpReg,
							  shared_ptr<const LlirOperand> targetList,
							  OctaveInstruction::BranchProbability);
      
      shared_ptr<OctaveInstruction> createJbnziInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const Register> src1, 
							   shared_ptr<const LlirOperand> src2, 
							   shared_ptr<const LlirOperand> cmpReg,
							   OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJbziInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const Register> src1, 
							  shared_ptr<const LlirOperand> src2, 
							  shared_ptr<const LlirOperand> cmpReg,
							  OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJtsetbInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> src1, 
							    shared_ptr<const UnsignedImmediate> bitpos, 
							    shared_ptr<const LlirOperand> disp,
							    OctaveInstruction::BranchProbability);
      
      shared_ptr<OctaveInstruction> createJtclrbInstruction(unsigned int lineNum,
							    unsigned int srcLineNum,
							    const char* srcFileName,
							    shared_ptr<const Register> src1, 
							    shared_ptr<const UnsignedImmediate> bitpos, 
							    shared_ptr<const LlirOperand> disp,
							    OctaveInstruction::BranchProbability);

      shared_ptr<OctaveInstruction> createJrnmiInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const LlirOperand> diFlag);
      
      shared_ptr<OctaveInstruction> createJrintInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const LlirOperand> diFlag);
      
      shared_ptr<OctaveInstruction> createJbrsInstruction(unsigned int lineNum,
							  unsigned int srcLineNum,
							  const char* srcFileName,
							  shared_ptr<const LlirOperand> dst);
      
      shared_ptr<OctaveInstruction> createJbrslInstruction(unsigned int lineNum,
							   unsigned int srcLineNum,
							   const char* srcFileName,
							   shared_ptr<const LlirOperand> brslFlags);

      shared_ptr<OctaveInstruction> createJbiInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const LlirOperand> src1,
							 shared_ptr<const LlirOperand> dst, 
							 shared_ptr<const LlirOperand> cdFlag);
      
      shared_ptr<OctaveInstruction> createJbrInstruction(unsigned int lineNum,
							 unsigned int srcLineNum,
							 const char* srcFileName,
							 shared_ptr<const Register> src1,
							 shared_ptr<const LlirOperand> dst,
							 shared_ptr<const LlirOperand> targetList);



    };
} // namespace Llir
#endif
